[
    {
        "title": "Reminder: AABB Accepting 2024 Annual Meeting Education Session Proposals",
        "url": "https://www.aabb.org/news-resources/news/article/2024/02/14/aabb-accepting-2024-annual-meeting-education-session-proposals",
        "date": "2024-02-14 19:08:57",
        "content": "AABB encourages members to become a part of the AABB Annual Meeting by submitting an educational session proposal for the 2024 meeting, taking place Oct. 19-22 in Houston, Texas."
    },
    {
        "title": "AABB Opens Annual Meeting Abstract Submission Period, Eliminates Submission Fee",
        "url": "https://www.aabb.org/news-resources/news/article/2024/02/07/aabb-opens-annual-meeting-abstract-submission-period--eliminates-submission-fee",
        "date": "2024-02-07 18:58:04",
        "content": "The AABB Selection of Abstracts Committee invites members of the blood and biotherapies community to shape the scientific content at the AABB Annual Meeting by submitting an abstract for the 2024 meeting."
    },
    {
        "title": "Nominate an Outstanding Colleague for an AABB Memorial Award",
        "url": "https://www.aabb.org/news-resources/news/article/2023/12/13/aabb-accepting-nominations-for-2024-memorial-awards",
        "date": "2023-12-13 21:18:31",
        "content": "AABB encourages members to contribute to AABB’s rich tradition of recognizing excellence by nominating colleagues who have left an indelible mark on AABB and the field of blood and biotherapies for AABB’s 2024 Memorial Awards."
    },
    {
        "title": "AABB24: Call for 2024 Annual Meeting Education Session Proposals Opening Soon",
        "url": "https://www.aabb.org/news-resources/news/article/2023/12/13/aabb24--call-for-2024-annual-meeting-education-session-proposals-opening-soon",
        "date": "2023-12-13 20:47:23",
        "content": "AABB will open the call for 2024 Annual Meeting education session proposals later this month. Ahead of that announcement, AABB encourages community members to consider what education sessions they would like to see at the 2024 Annual Meeting."
    },
    {
        "title": "REGULATORY UPDATE: ‘Ask the FDA and CMS/CLIA 2023’ Annual Meeting Slides Now Available",
        "url": "https://www.aabb.org/news-resources/news/article/2023/12/05/regulatory-update---ask-the-fda-and-cms-clia-2023--annual-meeting-slides-now-available",
        "date": "2023-12-05 20:13:59",
        "content": "The slide presentation from the 2023 AABB Annual Meeting session “Ask the FDA and CMS/CLIA” is now available with responses from each agency’s representatives included in the slides."
    },
    {
        "title": "November/December Issue of AABB News Focuses on 2023 Annual Meeting Highlights",
        "url": "https://www.aabb.org/news-resources/news/article/2023/11/30/november-december-issue-of-aabb-news-focuses-on-2023-annual-meeting-highlights",
        "date": "2023-11-30 15:36:36",
        "content": "The November/December issue of AABB News highlights key takeaways from the 2023 AABB Annual Meeting, which took place Oct. 14-17 in Nashville, Tenn."
    },
    {
        "title": "Deadline to Earn CE/CME Credits for Annual Meeting Sessions is Thursday",
        "url": "https://www.aabb.org/news-resources/news/article/2023/11/15/deadline-to-earn-ce-cme-credits-for-annual-meeting-sessions-is-thursday",
        "date": "2023-11-15 18:38:24",
        "content": "The deadline for 2023 Annual Meeting attendees to view on-demand recordings and earn continuing education (CE) credits is 2 p.m. ET on Thursday, Nov. 16. Attendees can access the on-demand recordings through the Annual Meeting Full Schedule."
    },
    {
        "title": "Reminder: On-Demand Annual Meeting Sessions Available Through Nov. 16",
        "url": "https://www.aabb.org/news-resources/news/article/2023/11/07/on-demand-annual-meeting-sessions-available-through-nov.-16",
        "date": "2023-11-07 18:59:38",
        "content": "On-demand recordings for the 2023 AABB Annual Meeting sessions are now available on the AABB website."
    },
    {
        "title": "AABB23: Directed Donations and Unvaccinated Donors",
        "url": "https://www.aabb.org/news-resources/news/article/2023/10/18/aabb23--directed-donations-and-unvaccinated-donors",
        "date": "2023-10-19 21:58:38",
        "content": "With requests for directed blood donations on the rise, how can clinicians use ethical principles to evaluate such requests and create policies accordingly?"
    },
    {
        "title": "AABB23: Implicit Bias in the Workforce and Health Care",
        "url": "https://www.aabb.org/news-resources/news/article/2023/10/18/aabb23--implicit-bias-in-the-workforce-and-health-care",
        "date": "2023-10-19 21:58:38",
        "content": "The set of principles known as Diversity, Equity, Inclusion and Access can be a powerful tool for combating implicit bias and health inequity."
    }
]